{
    "Description": "[h1]Brief Description[/h1]\r\nCustomize the experience for the second player on splitscreen, helping your relative/partner/friend getting better at the game and feel less useless!\r\n\r\n[h1]Why?[/h1]\r\nTrying to learn some basic scripting stuff on BO3! So I wanted to help a redditor that asked for this specific feature while playing with his girlfriend.\r\n\r\n[h1]Default Configuration[/h1]\r\nThe default configuration at match start gives:\r\n[olist]\r\n    [*] 300 maxHealth to the second player (7 zombie swipes, 4 more than default maxHealth, 2 more than Juggernog)\r\n    [*] Non pack-a-punched weapons\r\n    [*] Regular 500 points\r\n    [*] Juggernog, Speed Cola and Stamin Up for free at start, perks are retained when going down and there's no perk purchase limit\r\n[/olist]\r\n\r\n[h1]Customization (1) - Health[/h1]\r\n[b]You can tweak in-game how much health the little bro has with the following command:[/b]\r\n\r\n[i]This will give the little bro 400 as max health[/i]\r\n[code]lil_bro_maxhealth 400[/code]\r\n\r\n[h1]Customization (2) - Weapons[/h1]\r\n[b]You can force every weapon bought by the second player being pack-a-punched and with AAT on them using the following commands:[/b]\r\n\r\n[i]Default behaviour, bought weapons (bought after inserting the command) will be normal and can be regularly pack-a-punched[/i]\r\n[code]lil_bro_upgraded_weapons 0 0[/code]\r\n[i]This will force every bought weapon (bought after inserting the command) being pack-a-punched with a random AAT on them[/i]\r\n[code]lil_bro_upgraded_weapons 1 1[/code]\r\n[i]This will force every bought weapon (bought after inserting the command) being pack-a-punched without a random AAT on them, but that can still be double papped regularly[/i]\r\n[code]lil_bro_upgraded_weapons 1 0[/code]\r\n\r\n[h1]Customization (3) - Points[/h1]\r\n[b]You can add how many points you want to the second player with the following command:[/b]\r\n\r\n[i]This will add 5000 to the little bro points[/i]\r\n[code]lil_bro_points 5000[/code]\r\n\r\n[h1]Customization (4) - Perks[/h1]\r\n[b]At start the second player will receive JuggerNog, Speed Cola and Stamin up, perk purchase limits are removed and you retain perks when going down. This last option can be deactivated though:[/b]\r\n\r\n[i]This will turn on perks retain when going down[/i]\r\n[code]lil_bro_retain_perks 1[/code]\r\n[i]This will turn off perks retain when going down[/i]\r\n[code]lil_bro_retain_perks 0[/code]\r\n\r\n\r\n[h1]Notes[/h1]\r\n[list]\r\n     [*] Just a little reminder, if a player gets hit by a trap with infinite damage this will still instakill him if he doesn't have Juggernog, doesn't matter how much health the player actually has! That's just how traps work in this game, if the player has Jugg then the trap will just do 50 damage to him, like a single zombie swipe!\r\n    [*] [b]This mod does nothing if there's no splitscreen second player.[/b]\r\n[/list]\r\n\r\n[h1]ToDo[/h1]\r\n[list]\r\n    [*] [strike]Add customizable max health command[/strike]\r\n    [*] [strike]Add more modifiers[/strike]\r\n    [*] [strike]Movements and reload speed passive perks[strike]\r\n    [*] [strike]Keeping perks when going down[strike]\r\n    [*] Some HUD would be nice\r\n[/list] \r\n",
    "FolderName": "little_brother_mod",
    "PublisherID": "3021782868",
    "Tags": "Zombies",
    "Thumbnail": "",
    "Title": "Little Brother Mod",
    "Type": "mod"
}
